Repository: Tencent-RTC/TUILiveKit
Catalog: iOS/SeatGridView/Resources/Localized/SeatGridViewLocalized.xcstrings
Source language: en
Languages: zh_hans

# voiceCore.error.all.seat.occupied
source: All seats are full
zh_hans: 上麦人数已满

# voiceCore.error.already.in.OtherRoom
source: The current user is already in another room, you need to leave the room before joining a new one
zh_hans: 当前用户已在别的房间内，需要先退房才能加入新的房间

# voiceCore.error.already.in.seat
source: The current user is already on the seat
zh_hans: 当前用户已经在麦位上

# voiceCore.error.battleDisable.unconnected
source: Please connect before you begin the battle.
zh_hans: 发起PK前请先连线

# voiceCore.error.cameraDeviceEmpty
source: No camera device available, please insert a camera device to resolve this issue
zh_hans: 当前无摄像头设备，请插入摄像头设备解决该问题

# voiceCore.error.cameraNotAuthorized
source: Camera not authorized by the system, check system authorization
zh_hans: 摄像头没有系统授权, 检查系统授权

# voiceCore.error.cameraOccupied
source: Camera is occupied, check if other processes are using the camera
zh_hans: 摄像头被占用，检查是否有其他进程使用摄像头

# voiceCore.error.cameraStartFail
source: System issue, failed to open the camera. Check if the camera device is working properly
zh_hans: 系统问题，打开摄像头失败。检查摄像头设备是否正常

# voiceCore.error.conflict.requestId
source: Conflicting signaling request
zh_hans: 信令请求冲突

# voiceCore.error.connectionDisable.battle
source: The host is currently in battle with guests, unable to initiate Co-host.
zh_hans: 主播PK中，无法发起连线

# voiceCore.error.connectionDisable.connecting
source: The host is currently co-hosting with other streamers.
zh_hans: 主播连线中，无法发起连线

# voiceCore.error.connectionDisable.linkMic
source: The host is currently connecting with guests, unable to initiate Co-host.
zh_hans: 主播连麦中，无法发起连线

# voiceCore.error.connectionDisable.maxLimit
source: The number of co-hosting has exceeded the maximum limit.
zh_hans: 连线已超过最大人数限制

# voiceCore.error.exitNotSupported.forRoomOwner
source: Please transfer the room owner before leaving the room
zh_hans: 请转让房主后再退房

# voiceCore.error.failed
source: Uncategorized common error
zh_hans: 操作错误

# voiceCore.error.freqLimit
source: Request frequency limited, please try again later
zh_hans: 请求被限频，请稍后重试

# voiceCore.error.getScreenSharingTargetFailed
source: Failed to get screen sharing source (screen and window), check screen recording permissions
zh_hans: 获取屏幕分享源（屏幕和窗口）失败，检查屏幕录制权限

# voiceCore.error.invalid.userId
source: Invalid userId
zh_hans: 非法的userId

# voiceCore.error.invalidParameter
source: Illegal parameters were passed when calling the API, check if the input parameters are valid
zh_hans: 调用 API 时，传入的参数不合法，检查入参是否合法

# voiceCore.error.linkMicDisable.battling
source: The host is currently in battle with other streamers, unable to initiate Multi-guest.
zh_hans: 主播PK中，无法发起连麦

# voiceCore.error.linkMicDisable.connecting
source: The host is currently co-hosting with other streamers, unable to initiate Multi-guest.
zh_hans: 主播连线中，无法发起连麦

# voiceCore.error.max.seat.count.limit
source: Maximum number of seats exceeds the package limit
zh_hans: 最大麦位超出套餐包数量限制

# voiceCore.error.microphoneDeviceEmpty
source: No microphone device available
zh_hans: 当前无麦克风设备

# voiceCore.error.microphoneNotAuthorized
source: Microphone not authorized by the system, check system authorization
zh_hans: 麦克风没有系统授权，检查系统授权

# voiceCore.error.microphoneOccupied
source: Microphone is occupied
zh_hans: 麦克风被占用

# voiceCore.error.microphoneStartFail
source: System issue, failed to open the microphone. Check if the microphone device is working properly
zh_hans: 系统问题，打开麦克风失败。检查麦克风设备是否正常

# voiceCore.error.open.camera.need.permission.from.admin
source: You need to apply to the room owner or administrator before opening the camera
zh_hans: 需要向房主或管理员申请后打开摄像头

# voiceCore.error.open.camera.need.seat.unlock
source: The current seat video is locked, you need to unlock it before opening the camera
zh_hans: 当前麦位视频被锁，需要解锁后才能打开摄像头

# voiceCore.error.open.microphone.need.permission.from.admin
source: You need to apply to the room owner or administrator before opening the microphone
zh_hans: 需要向房主或管理员申请后打开麦克风

# voiceCore.error.open.microphone.need.seat.unlock
source: The current seat audio is locked, you need to unlock it before opening the microphone
zh_hans: 当前麦位音频被锁，需要解锁后才能打开麦克风

# voiceCore.error.open.screen.share.need.permission.from.admin
source: You need to apply to the room owner or administrator before opening the screen sharing
zh_hans: 需要向房主或管理员申请后打开屏幕分享

# voiceCore.error.open.screen.share.need.seat.unlock
source: The current seat screen sharing is locked, you need to unlock it before opening the screen sharing
zh_hans: 当前麦位屏幕分享被锁，需要解锁后才能打开屏幕分享

# voiceCore.error.operation.invalid.beforeEnterRoom
source: This feature can only be used after entering the room
zh_hans: 需要进房后才可使用此功能

# voiceCore.error.operation.notSupported.inCurrentRoomType
source: This operation is not supported in the current room type
zh_hans: 当前房间类型下不支持该操作

# voiceCore.error.operation.notSupported.inCurrentSpeechMode
source: This operation is not supported in the current speaking mode
zh_hans: 当前发言模式下不支持该操作

# voiceCore.error.permissionDenied
source: Permission acquisition failed, currently unauthorized for audio/video permissions, please check if device permissions are enabled
zh_hans: 获取权限失败，当前未授权音/视频权限，请查看是否开启设备权限

# voiceCore.error.repeat.operation
source: Duplicate operation
zh_hans: 重复操作

# voiceCore.error.repeat.requestId
source: Duplicate signaling request
zh_hans: 信令请求重复

# voiceCore.error.request.noPermission
source: No permission for signaling request, such as canceling an invitation that was not initiated by oneself
zh_hans: 信令请求无权限，例如取消非自己发起的邀请

# voiceCore.error.requestId.invalid
source: Invalid signaling request ID or has already been processed
zh_hans: 信令请求 ID 无效或已经被处理过

# voiceCore.error.requirePayment
source: Check if the cloud service account is normal
zh_hans: 检查云服务账户是否正常

# voiceCore.error.roomId.invalid
source: Invalid room ID created, custom ID must be printable ASCII characters (0x20-0x7e), up to 48 bytes
zh_hans: 创建房间 ID 非法，自定义 ID 必须为可打印 ASCII 字符（0x20-0x7e），最长 48 个字节

# voiceCore.error.roomId.notExist
source: The room does not exist when entering, it may have been disbanded
zh_hans: 进房时房间不存在，或许已被解散

# voiceCore.error.roomId.occupied
source: Room ID already in use, please choose another room ID
zh_hans: 房间 ID 已被使用，请选择别的房间 ID

# voiceCore.error.roomName.invalid
source: Invalid room name, the name can be up to 30 bytes, and the character encoding must be UTF-8 if it contains Chinese
zh_hans: 房间名称非法，名称最长 30 字节，字符编码必须是 UTF-8，如果包含中文

# voiceCore.error.sdkAppId.notFound
source: SDKAppID not found, please confirm the application information in the Tencent Cloud Video Cube SDK Console
zh_hans: 未找到 SDKAppID，请在腾讯云视立方 SDK[控制台](https://console.cloud.tencent.com/vcube/project/manage)确认应用信息

# voiceCore.error.sdkNotInitialized
source: Not logged in, please call the Login interface
zh_hans: 未登录,请调用 Login 接口

# voiceCore.error.seat.index.not.exist
source: Seat number does not exist
zh_hans: 麦位编号不存在

# voiceCore.error.seat.locked
source: The current seat is locked
zh_hans: 当前麦位被锁

# voiceCore.error.seat.not.support.link.mic
source: Does not support linking microphones
zh_hans: 不支持连麦

# voiceCore.error.seat.occupied
source: The current seat is already occupied
zh_hans: 当前麦位已经有人了

# voiceCore.error.send.message.disabled.for.all
source: All users are muted in the current room
zh_hans: 当前房间已开启全员禁言

# voiceCore.error.send.message.disabled.for.current
source: You have been muted in the current room
zh_hans: 当前房间内，您已被禁言

# voiceCore.error.startScreenSharingFailed
source: Failed to start screen sharing, check if someone else is screen sharing in the room
zh_hans: 开启屏幕分享失败，检查房间内是否有人正在屏幕分享

# voiceCore.error.success
source: Operation successful
zh_hans: 操作成功

# voiceCore.error.user.need.AdminPermission
source: Requires room owner or administrator permission to operate
zh_hans: 需要房主或者管理员权限才能操作

# voiceCore.error.user.need.OwnerPermission
source: Requires room owner permission to operate
zh_hans: 需要房主权限才能操作

# voiceCore.error.user.not.in.seat
source: The current user is not on the seat
zh_hans: 当前用户没有在麦上

# voiceCore.error.userNotEntered
source: User is not in the current room
zh_hans: 用户不在当前房间内

# voiceCore.error.userNotExist
source: User does not exist
zh_hans: 用户不存在

# voiceCore.fans.count.xxx
source: xxx fans
zh_hans: xxx粉丝

# voiceCore.room.list.live
source: Live
zh_hans: 直播

# voiceCore.room.list.loading
source: Loading...
zh_hans: 正在加载...

# voiceCore.room.list.loadingMore
source: Loading more
zh_hans: 加载更多

# voiceCore.room.list.noMoreData
source: There is no more data
zh_hans: 没有更多数据了

# voiceCore.room.list.pullToRefresh
source: Pull to refresh
zh_hans: 下拉刷新

# voiceCore.room.list.releaseToRefresh
source: Release to refresh
zh_hans: 松开刷新

# voiceCore.room.list.startLiveRoom
source: Please start a live room
zh_hans: 请先开启一个直播间

# voiceCore.room.list.watching.xxx
source: xxx people are watching
zh_hans: xxx人正在观看

# voiceCore.roomId.xxx
source: Stream Id: xxx
zh_hans: 直播房间ID: xxx

# voiceCore.seat.takeSeatApplying
source: You have submitted a link mic request, please wait for the author approval
zh_hans: 你提交了连麦申请，请等待主播同意
